{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report file with an empty features array, used for tracking implemented features.",
  "frontend-file-summaries.txt": "JSON file containing detailed summaries of all frontend components, hooks, configuration files, and their purposes in the portfolio application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph/Twitter Card tags, dark theme class, and module script loading for the React application.",
  "frontend/src/App.tsx": "Main application component orchestrating all portfolio sections with 2-second page load animation, cursor glow, animated background, navigation, and toast notifications.",
  "frontend/src/components/AboutSection.tsx": "About section with intersection observer animation, glassmorphism bio card, and four highlight cards showcasing programming passion, AI interest, problem-solving, and continuous learning.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based particle system creating animated network effect with particles that move, wrap around edges, and connect when within 120px distance, passing canvas dimensions to Particle constructor.",
  "frontend/src/components/CertificationsSection.tsx": "Certifications section displaying four certificate cards (Internshala, HP LIFE, Cursa, CAN) with 3D tilt effect, hover animations, certificate images, and glassmorphism styling.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with name, email, and message fields, social media links (GitHub, LinkedIn, Twitter, Email), and toast notifications for form submission feedback.",
  "frontend/src/components/CursorGlow.tsx": "Creates a radial gradient glow effect that follows the mouse cursor across the page using mousemove event listeners.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, attribution to caffeine.ai with UTM tracking, and a pulsing heart icon.",
  "frontend/src/components/HeroSection.tsx": "Hero section with animated title, subtitle, description, CTA buttons (View Projects, Download Resume), 3D background scene, and scroll indicator.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with smooth scrolling to sections, mobile hamburger menu, and glassmorphism effects that appear on scroll.",
  "frontend/src/components/PageLoadAnimation.tsx": "Full-screen loading animation with animated title, progress bar, and loading text that displays during initial page load.",
  "frontend/src/components/ProjectsSection.tsx": "Projects showcase section displaying three project categories (Web Frontend, AI Graphics, Programming) with 3D tilt effects, icons, descriptions, and technology tags.",
  "frontend/src/components/Scene3D.tsx": "Three.js 3D scene with an animated distorted sphere using react-three-fiber, featuring auto-rotation and colored point lights.",
  "frontend/src/components/SkillsSection.tsx": "Skills display section with animated progress bars for five technical skills (C, C++, Web Dev, UI Design, AI Tools), each with icons and gradient styling.",
  "frontend/src/hooks/use3DTilt.ts": "Custom React hook that applies 3D tilt effect to an element based on mouse position, calculating rotation angles and applying perspective transforms with smooth transitions on mouse move and leave events.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication provider and hook for ICP, managing login/logout flow, identity persistence, delegation validation, and authentication state with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks to interact with backend; currently unused as this is a static portfolio with no backend data storage.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark futuristic theme using OKLCH color space, defining CSS custom properties for neon colors (cyan, purple, pink), glassmorphism effects, glow shadows, and keyframe animations for floating, fade-in, and scroll indicators.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with OKLCH color system, custom neon colors, glassmorphism utilities, neon glow shadows, and keyframe animations for accordion, float, fade-in, and other effects used throughout the portfolio.",
  "project_state.json": "Project state document describing a dark futuristic portfolio website for Nightmare (CSE student) with glassmorphism, neon effects, 3D transformations, and sections for hero, about, skills, certifications, projects, and contact with image replacement requirements for certificates."
}